MikroElektronika/core_packages/PIC/XC8/def/PIC18F8490/mcu.h
#define                                 S34C2_bit           _BIT_ACCESS(LCDDATA16,2)
// LCDDATA22<S34C3>
extern volatile __bit                   S34C3               __at(0x7BDA);	// @ (0xF7B * 8 + 2)
#define                                 S34C3_bit           _BIT_ACCESS(LCDDATA22,2)
// LCDDATA4<S35C0>
extern volatile __bit                   S35C0               __at(0x7B23);	// @ (0xF64 * 8 + 3)
#define                                 S35C0_bit           _BIT_ACCESS(LCDDATA4,3)
// LCDDATA10<S35C1>
extern volatile __bit                   S35C1               __at(0x7B53);	// @ (0xF6A * 8 + 3)
#define                                 S35C1_bit           _BIT_ACCESS(LCDDATA10,3)
// LCDDATA16<S35C2>
extern volatile __bit                   S35C2               __at(0x7BAB);	// @ (0xF75 * 8 + 3)
#define                                 S35C2_bit           _BIT_ACCESS(LCDDATA16,3)
// LCDDATA22<S35C3>
extern volatile __bit                   S35C3               __at(0x7BDB);	// @ (0xF7B * 8 + 3)
#define                                 S35C3_bit           _BIT_ACCESS(LCDDATA22,3)
// LCDDATA4<S36C0>
extern volatile __bit                   S36C0               __at(0x7B24);	// @ (0xF64 * 8 + 4)
#define                                 S36C0_bit           _BIT_ACCESS(LCDDATA4,4)
// LCDDATA10<S36C1>
extern volatile __bit                   S36C1               __at(0x7B54);	// @ (0xF6A * 8 + 4)
#define                                 S36C1_bit           _BIT_ACCESS(LCDDATA10,4)
// LCDDATA16<S36C2>
extern volatile __bit                   S36C2               __at(0x7BAC);	// @ (0xF75 * 8 + 4)
#define                                 S36C2_bit           _BIT_ACCESS(LCDDATA16,4)
// LCDDATA22<S36C3>
extern volatile __bit                   S36C3               __at(0x7BDC);	// @ (0xF7B * 8 + 4)
#define                                 S36C3_bit           _BIT_ACCESS(LCDDATA22,4)
// LCDDATA4<S37C0>
extern volatile __bit                   S37C0               __at(0x7B25);	// @ (0xF64 * 8 + 5)
#define                                 S37C0_bit           _BIT_ACCESS(LCDDATA4,5)
// LCDDATA10<S37C1>
extern volatile __bit                   S37C1               __at(0x7B55);	// @ (0xF6A * 8 + 5)
#define                                 S37C1_bit           _BIT_ACCESS(LCDDATA10,5)
// LCDDATA16<S37C2>
extern volatile __bit                   S37C2               __at(0x7BAD);	// @ (0xF75 * 8 + 5)
#define                                 S37C2_bit           _BIT_ACCESS(LCDDATA16,5)
// LCDDATA22<S37C3>
extern volatile __bit                   S37C3               __at(0x7BDD);	// @ (0xF7B * 8 + 5)
#define                                 S37C3_bit           _BIT_ACCESS(LCDDATA22,5)
// LCDDATA4<S38C0>
extern volatile __bit                   S38C0               __at(0x7B26);	// @ (0xF64 * 8 + 6)
#define                                 S38C0_bit           _BIT_ACCESS(LCDDATA4,6)
// LCDDATA10<S38C1>
extern volatile __bit                   S38C1               __at(0x7B56);	// @ (0xF6A * 8 + 6)
#define                                 S38C1_bit           _BIT_ACCESS(LCDDATA10,6)
// LCDDATA16<S38C2>
extern volatile __bit                   S38C2               __at(0x7BAE);	// @ (0xF75 * 8 + 6)
#define                                 S38C2_bit           _BIT_ACCESS(LCDDATA16,6)
// LCDDATA22<S38C3>
extern volatile __bit                   S38C3               __at(0x7BDE);	// @ (0xF7B * 8 + 6)
#define                                 S38C3_bit           _BIT_ACCESS(LCDDATA22,6)
// LCDDATA4<S39C0>
extern volatile __bit                   S39C0               __at(0x7B27);	// @ (0xF64 * 8 + 7)
#define                                 S39C0_bit           _BIT_ACCESS(LCDDATA4,7)
// LCDDATA10<S39C1>
extern volatile __bit                   S39C1               __at(0x7B57);	// @ (0xF6A * 8 + 7)
#define                                 S39C1_bit           _BIT_ACCESS(LCDDATA10,7)
// LCDDATA16<S39C2>
extern volatile __bit                   S39C2               __at(0x7BAF);	// @ (0xF75 * 8 + 7)
#define                                 S39C2_bit           _BIT_ACCESS(LCDDATA16,7)
// LCDDATA22<S39C3>
extern volatile __bit                   S39C3               __at(0x7BDF);	// @ (0xF7B * 8 + 7)
#define                                 S39C3_bit           _BIT_ACCESS(LCDDATA22,7)
// LCDDATA0<S3C0>
extern volatile __bit                   S3C0                __at(0x7B03);	// @ (0xF60 * 8 + 3)
#define                                 S3C0_bit            _BIT_ACCESS(LCDDATA0,3)
// LCDDATA6<S3C1>
extern volatile __bit                   S3C1                __at(0x7B33);	// @ (0xF66 * 8 + 3)
#define                                 S3C1_bit            _BIT_ACCESS(LCDDATA6,3)
// LCDDATA12<S3C2>
extern volatile __bit                   S3C2                __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 S3C2_bit            _BIT_ACCESS(LCDDATA12,3)
// LCDDATA18<S3C3>
extern volatile __bit                   S3C3                __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 S3C3_bit            _BIT_ACCESS(LCDDATA18,3)
// LCDDATA5<S40C0>
extern volatile __bit                   S40C0               __at(0x7B28);	// @ (0xF65 * 8 + 0)
#define                                 S40C0_bit           _BIT_ACCESS(LCDDATA5,0)
// LCDDATA11<S40C1>
extern volatile __bit                   S40C1               __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 S40C1_bit           _BIT_ACCESS(LCDDATA11,0)
// LCDDATA5<S40C15>
extern volatile __bit                   S40C15              __at(0x7B28);	// @ (0xF65 * 8 + 0)
#define                                 S40C15_bit          _BIT_ACCESS(LCDDATA5,0)
// LCDDATA17<S40C2>
extern volatile __bit                   S40C2               __at(0x7BB0);	// @ (0xF76 * 8 + 0)
#define                                 S40C2_bit           _BIT_ACCESS(LCDDATA17,0)
// LCDDATA23<S40C3>
extern volatile __bit                   S40C3               __at(0x7BE0);	// @ (0xF7C * 8 + 0)
#define                                 S40C3_bit           _BIT_ACCESS(LCDDATA23,0)
// LCDDATA5<S41C0>
extern volatile __bit                   S41C0               __at(0x7B29);	// @ (0xF65 * 8 + 1)
#define                                 S41C0_bit           _BIT_ACCESS(LCDDATA5,1)
// LCDDATA11<S41C1>
extern volatile __bit                   S41C1               __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 S41C1_bit           _BIT_ACCESS(LCDDATA11,1)
// LCDDATA17<S41C2>
extern volatile __bit                   S41C2               __at(0x7BB1);	// @ (0xF76 * 8 + 1)
#define                                 S41C2_bit           _BIT_ACCESS(LCDDATA17,1)
// LCDDATA23<S41C3>
extern volatile __bit                   S41C3               __at(0x7BE1);	// @ (0xF7C * 8 + 1)
#define                                 S41C3_bit           _BIT_ACCESS(LCDDATA23,1)
// LCDDATA5<S42C0>
extern volatile __bit                   S42C0               __at(0x7B2A);	// @ (0xF65 * 8 + 2)
#define                                 S42C0_bit           _BIT_ACCESS(LCDDATA5,2)
// LCDDATA11<S42C1>
extern volatile __bit                   S42C1               __at(0x7B82);	// @ (0xF70 * 8 + 2)
#define                                 S42C1_bit           _BIT_ACCESS(LCDDATA11,2)
// LCDDATA17<S42C2>
extern volatile __bit                   S42C2               __at(0x7BB2);	// @ (0xF76 * 8 + 2)
#define                                 S42C2_bit           _BIT_ACCESS(LCDDATA17,2)
// LCDDATA23<S42C3>
extern volatile __bit                   S42C3               __at(0x7BE2);	// @ (0xF7C * 8 + 2)
#define                                 S42C3_bit           _BIT_ACCESS(LCDDATA23,2)
// LCDDATA5<S43C0>
extern volatile __bit                   S43C0               __at(0x7B2B);	// @ (0xF65 * 8 + 3)
#define                                 S43C0_bit           _BIT_ACCESS(LCDDATA5,3)
// LCDDATA11<S43C1>
extern volatile __bit                   S43C1               __at(0x7B83);	// @ (0xF70 * 8 + 3)
#define                                 S43C1_bit           _BIT_ACCESS(LCDDATA11,3)
// LCDDATA17<S43C2>
extern volatile __bit                   S43C2               __at(0x7BB3);	// @ (0xF76 * 8 + 3)
#define                                 S43C2_bit           _BIT_ACCESS(LCDDATA17,3)
// LCDDATA23<S43C3>
extern volatile __bit                   S43C3               __at(0x7BE3);	// @ (0xF7C * 8 + 3)
#define                                 S43C3_bit           _BIT_ACCESS(LCDDATA23,3)
// LCDDATA5<S44C0>
extern volatile __bit                   S44C0               __at(0x7B2C);	// @ (0xF65 * 8 + 4)
#define                                 S44C0_bit           _BIT_ACCESS(LCDDATA5,4)
// LCDDATA11<S44C1>
extern volatile __bit                   S44C1               __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 S44C1_bit           _BIT_ACCESS(LCDDATA11,4)
// LCDDATA17<S44C2>
extern volatile __bit                   S44C2               __at(0x7BB4);	// @ (0xF76 * 8 + 4)
#define                                 S44C2_bit           _BIT_ACCESS(LCDDATA17,4)
// LCDDATA23<S44C3>
extern volatile __bit                   S44C3               __at(0x7BE4);	// @ (0xF7C * 8 + 4)
#define                                 S44C3_bit           _BIT_ACCESS(LCDDATA23,4)
// LCDDATA5<S45C0>
extern volatile __bit                   S45C0               __at(0x7B2D);	// @ (0xF65 * 8 + 5)
#define                                 S45C0_bit           _BIT_ACCESS(LCDDATA5,5)
// LCDDATA11<S45C1>
extern volatile __bit                   S45C1               __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 S45C1_bit           _BIT_ACCESS(LCDDATA11,5)
// LCDDATA17<S45C2>
extern volatile __bit                   S45C2               __at(0x7BB5);	// @ (0xF76 * 8 + 5)
#define                                 S45C2_bit           _BIT_ACCESS(LCDDATA17,5)
// LCDDATA23<S45C3>
extern volatile __bit                   S45C3               __at(0x7BE5);	// @ (0xF7C * 8 + 5)
#define                                 S45C3_bit           _BIT_ACCESS(LCDDATA23,5)
// LCDDATA5<S46C0>
extern volatile __bit                   S46C0               __at(0x7B2E);	// @ (0xF65 * 8 + 6)
#define                                 S46C0_bit           _BIT_ACCESS(LCDDATA5,6)
// LCDDATA11<S46C1>
extern volatile __bit                   S46C1               __at(0x7B86);	// @ (0xF70 * 8 + 6)
#define                                 S46C1_bit           _BIT_ACCESS(LCDDATA11,6)
// LCDDATA17<S46C2>
extern volatile __bit                   S46C2               __at(0x7BB6);	// @ (0xF76 * 8 + 6)
#define                                 S46C2_bit           _BIT_ACCESS(LCDDATA17,6)
// LCDDATA23<S46C3>
extern volatile __bit                   S46C3               __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 S46C3_bit           _BIT_ACCESS(LCDDATA23,6)
// LCDDATA5<S47C0>
extern volatile __bit                   S47C0               __at(0x7B2F);	// @ (0xF65 * 8 + 7)
#define                                 S47C0_bit           _BIT_ACCESS(LCDDATA5,7)
// LCDDATA11<S47C1>
extern volatile __bit                   S47C1               __at(0x7B87);	// @ (0xF70 * 8 + 7)
#define                                 S47C1_bit           _BIT_ACCESS(LCDDATA11,7)
// LCDDATA17<S47C2>
extern volatile __bit                   S47C2               __at(0x7BB7);	// @ (0xF76 * 8 + 7)
#define                                 S47C2_bit           _BIT_ACCESS(LCDDATA17,7)
// LCDDATA23<S47C3>
extern volatile __bit                   S47C3               __at(0x7BE7);	// @ (0xF7C * 8 + 7)
#define                                 S47C3_bit           _BIT_ACCESS(LCDDATA23,7)
// LCDDATA0<S4C0>
extern volatile __bit                   S4C0                __at(0x7B04);	// @ (0xF60 * 8 + 4)
#define                                 S4C0_bit            _BIT_ACCESS(LCDDATA0,4)
// LCDDATA6<S4C1>
extern volatile __bit                   S4C1                __at(0x7B34);	// @ (0xF66 * 8 + 4)
#define                                 S4C1_bit            _BIT_ACCESS(LCDDATA6,4)
// LCDDATA12<S4C2>
extern volatile __bit                   S4C2                __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 S4C2_bit            _BIT_ACCESS(LCDDATA12,4)
// LCDDATA18<S4C3>
extern volatile __bit                   S4C3                __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 S4C3_bit            _BIT_ACCESS(LCDDATA18,4)
// LCDDATA0<S5C0>
extern volatile __bit                   S5C0                __at(0x7B05);	// @ (0xF60 * 8 + 5)
#define                                 S5C0_bit            _BIT_ACCESS(LCDDATA0,5)
// LCDDATA6<S5C1>
extern volatile __bit                   S5C1                __at(0x7B35);	// @ (0xF66 * 8 + 5)
#define                                 S5C1_bit            _BIT_ACCESS(LCDDATA6,5)
// LCDDATA12<S5C2>
extern volatile __bit                   S5C2                __at(0x7B8D);	// @ (0xF71 * 8 + 5)
#define                                 S5C2_bit            _BIT_ACCESS(LCDDATA12,5)
// LCDDATA18<S5C3>
extern volatile __bit                   S5C3                __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 S5C3_bit            _BIT_ACCESS(LCDDATA18,5)
// LCDDATA0<S6C0>
extern volatile __bit                   S6C0                __at(0x7B06);	// @ (0xF60 * 8 + 6)
#define                                 S6C0_bit            _BIT_ACCESS(LCDDATA0,6)
// LCDDATA6<S6C1>
extern volatile __bit                   S6C1                __at(0x7B36);	// @ (0xF66 * 8 + 6)
#define                                 S6C1_bit            _BIT_ACCESS(LCDDATA6,6)
// LCDDATA12<S6C2>
extern volatile __bit                   S6C2                __at(0x7B8E);	// @ (0xF71 * 8 + 6)
#define                                 S6C2_bit            _BIT_ACCESS(LCDDATA12,6)
// LCDDATA18<S6C3>
extern volatile __bit                   S6C3                __at(0x7BBE);	// @ (0xF77 * 8 + 6)
#define                                 S6C3_bit            _BIT_ACCESS(LCDDATA18,6)
// LCDDATA0<S7C0>
extern volatile __bit                   S7C0                __at(0x7B07);	// @ (0xF60 * 8 + 7)
#define                                 S7C0_bit            _BIT_ACCESS(LCDDATA0,7)
// LCDDATA6<S7C1>
extern volatile __bit                   S7C1                __at(0x7B37);	// @ (0xF66 * 8 + 7)
#define                                 S7C1_bit            _BIT_ACCESS(LCDDATA6,7)
// LCDDATA12<S7C2>
extern volatile __bit                   S7C2                __at(0x7B8F);	// @ (0xF71 * 8 + 7)
#define                                 S7C2_bit            _BIT_ACCESS(LCDDATA12,7)
// LCDDATA18<S7C3>
extern volatile __bit                   S7C3                __at(0x7BBF);	// @ (0xF77 * 8 + 7)
#define                                 S7C3_bit            _BIT_ACCESS(LCDDATA18,7)
// LCDDATA1<S8C0>
extern volatile __bit                   S8C0                __at(0x7B08);	// @ (0xF61 * 8 + 0)
#define                                 S8C0_bit            _BIT_ACCESS(LCDDATA1,0)
// LCDDATA7<S8C1>
extern volatile __bit                   S8C1                __at(0x7B38);	// @ (0xF67 * 8 + 0)
#define                                 S8C1_bit            _BIT_ACCESS(LCDDATA7,0)
// LCDDATA13<S8C2>
extern volatile __bit                   S8C2                __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 S8C2_bit            _BIT_ACCESS(LCDDATA13,0)
// LCDDATA19<S8C3>
extern volatile __bit                   S8C3                __at(0x7BC0);	// @ (0xF78 * 8 + 0)
#define                                 S8C3_bit            _BIT_ACCESS(LCDDATA19,0)
// LCDDATA1<S9C0>
extern volatile __bit                   S9C0                __at(0x7B09);	// @ (0xF61 * 8 + 1)
#define                                 S9C0_bit            _BIT_ACCESS(LCDDATA1,1)
// LCDDATA7<S9C1>
extern volatile __bit                   S9C1                __at(0x7B39);	// @ (0xF67 * 8 + 1)
#define                                 S9C1_bit            _BIT_ACCESS(LCDDATA7,1)
// LCDDATA13<S9C2>
extern volatile __bit                   S9C2                __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 S9C2_bit            _BIT_ACCESS(LCDDATA13,1)
// LCDDATA19<S9C3>
extern volatile __bit                   S9C3                __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 S9C3_bit            _BIT_ACCESS(LCDDATA19,1)
// RCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x7E86);	// @ (0xFD0 * 8 + 6)
#define                                 SBOREN_bit          _BIT_ACCESS(RCON,6)
// PORTC<SCK>
extern volatile __bit                   SCK                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SCK_bit             _BIT_ACCESS(PORTC,3)
// BAUDCON1<SCKP>
extern volatile __bit                   SCKP                __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUDCON1,4)
// BAUDCON1<SCKP1>
extern volatile __bit                   SCKP1               __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 SCKP1_bit           _BIT_ACCESS(BAUDCON1,4)
// PORTC<SCL>
extern volatile __bit                   SCL                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SCL_bit             _BIT_ACCESS(PORTC,3)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x7E99);	// @ (0xFD3 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// PORTC<SDA>
extern volatile __bit                   SDA                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SDA_bit             _BIT_ACCESS(PORTC,4)
// PORTC<SDI>
extern volatile __bit                   SDI                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SDI_bit             _BIT_ACCESS(PORTC,4)
// PORTC<SDO>
extern volatile __bit                   SDO                 __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 SDO_bit             _BIT_ACCESS(PORTC,5)
// LCDSE0<SE0>
extern volatile __bit                   SE0                 __at(0x7AD0);	// @ (0xF5A * 8 + 0)
#define                                 SE0_bit             _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SE1>
extern volatile __bit                   SE1                 __at(0x7AD1);	// @ (0xF5A * 8 + 1)
#define                                 SE1_bit             _BIT_ACCESS(LCDSE0,1)
// LCDSE1<SE10>
extern volatile __bit                   SE10                __at(0x7ADA);	// @ (0xF5B * 8 + 2)
#define                                 SE10_bit            _BIT_ACCESS(LCDSE1,2)
// LCDSE1<SE11>
extern volatile __bit                   SE11                __at(0x7ADB);	// @ (0xF5B * 8 + 3)
#define                                 SE11_bit            _BIT_ACCESS(LCDSE1,3)
// LCDSE1<SE12>
extern volatile __bit                   SE12                __at(0x7ADC);	// @ (0xF5B * 8 + 4)
#define                                 SE12_bit            _BIT_ACCESS(LCDSE1,4)
// LCDSE1<SE13>
extern volatile __bit                   SE13                __at(0x7ADD);	// @ (0xF5B * 8 + 5)
#define                                 SE13_bit            _BIT_ACCESS(LCDSE1,5)
// LCDSE1<SE14>
extern volatile __bit                   SE14                __at(0x7ADE);	// @ (0xF5B * 8 + 6)
#define                                 SE14_bit            _BIT_ACCESS(LCDSE1,6)
// LCDSE1<SE15>
extern volatile __bit                   SE15                __at(0x7ADF);	// @ (0xF5B * 8 + 7)
#define                                 SE15_bit            _BIT_ACCESS(LCDSE1,7)
// LCDSE2<SE16>
extern volatile __bit                   SE16                __at(0x7AE0);	// @ (0xF5C * 8 + 0)
#define                                 SE16_bit            _BIT_ACCESS(LCDSE2,0)
// LCDSE2<SE17>
extern volatile __bit                   SE17                __at(0x7AE1);	// @ (0xF5C * 8 + 1)
#define                                 SE17_bit            _BIT_ACCESS(LCDSE2,1)
// LCDSE2<SE18>
extern volatile __bit                   SE18                __at(0x7AE2);	// @ (0xF5C * 8 + 2)
#define                                 SE18_bit            _BIT_ACCESS(LCDSE2,2)
// LCDSE2<SE19>
extern volatile __bit                   SE19                __at(0x7AE3);	// @ (0xF5C * 8 + 3)
#define                                 SE19_bit            _BIT_ACCESS(LCDSE2,3)
// LCDSE0<SE2>
extern volatile __bit                   SE2                 __at(0x7AD2);	// @ (0xF5A * 8 + 2)
#define                                 SE2_bit             _BIT_ACCESS(LCDSE0,2)
// LCDSE2<SE20>
extern volatile __bit                   SE20                __at(0x7AE4);	// @ (0xF5C * 8 + 4)
#define                                 SE20_bit            _BIT_ACCESS(LCDSE2,4)
// LCDSE2<SE21>
extern volatile __bit                   SE21                __at(0x7AE5);	// @ (0xF5C * 8 + 5)
#define                                 SE21_bit            _BIT_ACCESS(LCDSE2,5)
// LCDSE2<SE22>
extern volatile __bit                   SE22                __at(0x7AE6);	// @ (0xF5C * 8 + 6)
#define                                 SE22_bit            _BIT_ACCESS(LCDSE2,6)
// LCDSE2<SE23>
extern volatile __bit                   SE23                __at(0x7AE7);	// @ (0xF5C * 8 + 7)
#define                                 SE23_bit            _BIT_ACCESS(LCDSE2,7)
// LCDSE3<SE24>
extern volatile __bit                   SE24                __at(0x7AE8);	// @ (0xF5D * 8 + 0)
#define                                 SE24_bit            _BIT_ACCESS(LCDSE3,0)
// LCDSE3<SE25>
extern volatile __bit                   SE25                __at(0x7AE9);	// @ (0xF5D * 8 + 1)
#define                                 SE25_bit            _BIT_ACCESS(LCDSE3,1)
// LCDSE3<SE26>
extern volatile __bit                   SE26                __at(0x7AEA);	// @ (0xF5D * 8 + 2)
#define                                 SE26_bit            _BIT_ACCESS(LCDSE3,2)
// LCDSE3<SE27>
extern volatile __bit                   SE27                __at(0x7AEB);	// @ (0xF5D * 8 + 3)
#define                                 SE27_bit            _BIT_ACCESS(LCDSE3,3)
// LCDSE3<SE28>
extern volatile __bit                   SE28                __at(0x7AEC);	// @ (0xF5D * 8 + 4)
#define                                 SE28_bit            _BIT_ACCESS(LCDSE3,4)
// LCDSE3<SE29>
extern volatile __bit                   SE29                __at(0x7AED);	// @ (0xF5D * 8 + 5)
#define                                 SE29_bit            _BIT_ACCESS(LCDSE3,5)
// LCDSE0<SE3>
extern volatile __bit                   SE3                 __at(0x7AD3);	// @ (0xF5A * 8 + 3)
#define                                 SE3_bit             _BIT_ACCESS(LCDSE0,3)
// LCDSE3<SE30>
extern volatile __bit                   SE30                __at(0x7AEE);	// @ (0xF5D * 8 + 6)
#define                                 SE30_bit            _BIT_ACCESS(LCDSE3,6)
// LCDSE3<SE31>
extern volatile __bit                   SE31                __at(0x7AEF);	// @ (0xF5D * 8 + 7)
#define                                 SE31_bit            _BIT_ACCESS(LCDSE3,7)
// LCDSE4<SE32>
extern volatile __bit                   SE32                __at(0x7AF0);	// @ (0xF5E * 8 + 0)
#define                                 SE32_bit            _BIT_ACCESS(LCDSE4,0)
// LCDSE4<SE33>
extern volatile __bit                   SE33                __at(0x7AF1);	// @ (0xF5E * 8 + 1)
#define                                 SE33_bit            _BIT_ACCESS(LCDSE4,1)
// LCDSE4<SE34>
extern volatile __bit                   SE34                __at(0x7AF2);	// @ (0xF5E * 8 + 2)
#define                                 SE34_bit            _BIT_ACCESS(LCDSE4,2)
// LCDSE4<SE35>
